; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v10 ?v12)
             (pred_6 ?v11 ?v5)
             (pred_7 ?v10 ?v5)
             (pred_11 ?v13 ?v10 )
	     (pred_2 ?v10)
             (pred_12 ?v3)
             (pred_8 ?v11)
             (pred_10 ?v5)
             (pred_5 ?v10)
             (pred_1 ?v11)
             (pred_4 ?v10)
             (pred_3 ))



(:action op_3
:parameters (?v9 ?v8 ?v7 ?v4)
:precondition (and (pred_12 ?v9) (pred_12 ?v8) (pred_8 ?v7) (pred_10 ?v4)
          (pred_9 ?v9 ?v8) (pred_6 ?v7 ?v4)
                   (pred_7 ?v8 ?v4) (pred_2 ?v9) 
                   (pred_5 ?v8) (pred_1 ?v7))
:effect (and  (pred_4 ?v8) (not (pred_5 ?v8))))


(:action op_4
:parameters (?v9 ?v1)
:precondition (and (pred_12 ?v9) (pred_12 ?v1)
               (pred_2 ?v9) (pred_9 ?v9 ?v1) (pred_4 ?v1))
:effect (and (pred_2 ?v1) (not (pred_2 ?v9))))

(:action op_2
:parameters (?v9 ?v7)
:precondition (and (pred_12 ?v9) (pred_8 ?v7) 
                  (pred_2 ?v9) (pred_11 ?v7 ?v9) (pred_3 ))
:effect (and (pred_1 ?v7)
   (not (pred_11 ?v7 ?v9)) (not (pred_3 ))))


(:action op_1
:parameters (?v9 ?v6 ?v2)
:precondition (and (pred_12 ?v9) (pred_8 ?v6) (pred_8 ?v2)
                  (pred_2 ?v9) (pred_1 ?v2) (pred_11 ?v6 ?v9))
:effect (and (pred_1 ?v6) (pred_11 ?v2 ?v9)
        (not (pred_1 ?v2)) (not (pred_11 ?v6 ?v9))))

(:action op_5
:parameters (?v9 ?v7)
:precondition (and (pred_12 ?v9) (pred_8 ?v7) 
                  (pred_2 ?v9) (pred_1 ?v7))
:effect (and (pred_3 ) (pred_11 ?v7 ?v9) (not (pred_1 ?v7)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_22 obj_27 obj_08 obj_12 obj_17 obj_11 obj_21 obj_07 obj_24 obj_01 obj_10 obj_13 obj_28 obj_04 obj_30 obj_20 obj_16 obj_26 obj_06 obj_09 obj_29 obj_25 obj_19 obj_18
    obj_03 obj_23
    obj_14 obj_15 obj_05
    )

    (:init
       (pred_3)

       (pred_12 obj_02)
       (pred_12 obj_22)
       (pred_12 obj_27)
       (pred_12 obj_08)
       (pred_12 obj_12)
       (pred_12 obj_17)
       (pred_12 obj_11)
       (pred_12 obj_21)
       (pred_12 obj_07)
       (pred_12 obj_24)
       (pred_12 obj_01)
       (pred_12 obj_10)
       (pred_12 obj_13)
       (pred_12 obj_28)
       (pred_12 obj_04)
       (pred_12 obj_30)
       (pred_12 obj_20)
       (pred_12 obj_16)
       (pred_12 obj_26)
       (pred_12 obj_06)
       (pred_12 obj_09)
       (pred_12 obj_29)
       (pred_12 obj_25)
       (pred_12 obj_19)
       (pred_12 obj_18)
       (pred_10 obj_03)
       (pred_10 obj_23)
       (pred_8 obj_14)
       (pred_8 obj_15)
       (pred_8 obj_05)

       (pred_9 obj_02 obj_17)
       (pred_9 obj_02 obj_22)
       (pred_9 obj_22 obj_11)
       (pred_9 obj_22 obj_27)
       (pred_9 obj_22 obj_02)
       (pred_9 obj_27 obj_21)
       (pred_9 obj_27 obj_08)
       (pred_9 obj_27 obj_22)
       (pred_9 obj_08 obj_07)
       (pred_9 obj_08 obj_12)
       (pred_9 obj_08 obj_27)
       (pred_9 obj_12 obj_24)
       (pred_9 obj_12 obj_08)
       (pred_9 obj_17 obj_01)
       (pred_9 obj_17 obj_11)
       (pred_9 obj_17 obj_02)
       (pred_9 obj_11 obj_10)
       (pred_9 obj_11 obj_21)
       (pred_9 obj_11 obj_22)
       (pred_9 obj_11 obj_17)
       (pred_9 obj_21 obj_13)
       (pred_9 obj_21 obj_07)
       (pred_9 obj_21 obj_27)
       (pred_9 obj_21 obj_11)
       (pred_9 obj_07 obj_28)
       (pred_9 obj_07 obj_24)
       (pred_9 obj_07 obj_08)
       (pred_9 obj_07 obj_21)
       (pred_9 obj_24 obj_04)
       (pred_9 obj_24 obj_12)
       (pred_9 obj_24 obj_07)
       (pred_9 obj_01 obj_30)
       (pred_9 obj_01 obj_10)
       (pred_9 obj_01 obj_17)
       (pred_9 obj_10 obj_20)
       (pred_9 obj_10 obj_13)
       (pred_9 obj_10 obj_11)
       (pred_9 obj_10 obj_01)
       (pred_9 obj_13 obj_16)
       (pred_9 obj_13 obj_28)
       (pred_9 obj_13 obj_21)
       (pred_9 obj_13 obj_10)
       (pred_9 obj_28 obj_26)
       (pred_9 obj_28 obj_04)
       (pred_9 obj_28 obj_07)
       (pred_9 obj_28 obj_13)
       (pred_9 obj_04 obj_06)
       (pred_9 obj_04 obj_24)
       (pred_9 obj_04 obj_28)
       (pred_9 obj_30 obj_09)
       (pred_9 obj_30 obj_20)
       (pred_9 obj_30 obj_01)
       (pred_9 obj_20 obj_29)
       (pred_9 obj_20 obj_16)
       (pred_9 obj_20 obj_10)
       (pred_9 obj_20 obj_30)
       (pred_9 obj_16 obj_25)
       (pred_9 obj_16 obj_26)
       (pred_9 obj_16 obj_13)
       (pred_9 obj_16 obj_20)
       (pred_9 obj_26 obj_19)
       (pred_9 obj_26 obj_06)
       (pred_9 obj_26 obj_28)
       (pred_9 obj_26 obj_16)
       (pred_9 obj_06 obj_18)
       (pred_9 obj_06 obj_04)
       (pred_9 obj_06 obj_26)
       (pred_9 obj_09 obj_29)
       (pred_9 obj_09 obj_30)
       (pred_9 obj_29 obj_25)
       (pred_9 obj_29 obj_20)
       (pred_9 obj_29 obj_09)
       (pred_9 obj_25 obj_19)
       (pred_9 obj_25 obj_16)
       (pred_9 obj_25 obj_29)
       (pred_9 obj_19 obj_18)
       (pred_9 obj_19 obj_26)
       (pred_9 obj_19 obj_25)
       (pred_9 obj_18 obj_06)
       (pred_9 obj_18 obj_19)
       (pred_5 obj_08)
       (pred_5 obj_29)
       (pred_5 obj_18)
       (pred_7  obj_08 obj_03)
       (pred_7  obj_29 obj_23)
       (pred_7  obj_18 obj_23)
       (pred_4 obj_02)
       (pred_4 obj_22)
       (pred_4 obj_27)
       (pred_4 obj_12)
       (pred_4 obj_17)
       (pred_4 obj_11)
       (pred_4 obj_21)
       (pred_4 obj_07)
       (pred_4 obj_24)
       (pred_4 obj_01)
       (pred_4 obj_10)
       (pred_4 obj_13)
       (pred_4 obj_28)
       (pred_4 obj_04)
       (pred_4 obj_30)
       (pred_4 obj_20)
       (pred_4 obj_16)
       (pred_4 obj_26)
       (pred_4 obj_06)
       (pred_4 obj_09)
       (pred_4 obj_25)
       (pred_4 obj_19)

       (pred_6  obj_14 obj_03)
       (pred_6  obj_15 obj_23)
       (pred_6  obj_05 obj_23)
       (pred_11 obj_14 obj_12)
       (pred_11 obj_15 obj_06)
       (pred_11 obj_05 obj_10)
       (pred_2 obj_01)
    )

    (:goal (and
       (pred_11 obj_14 obj_21)
    ))
(:constraints
  (always (not (pred_2 obj_07)))
)
)

; plan
1. (op_4 obj_01 obj_10)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_10)
   goals met: 0 of 1
2. (op_2 obj_10 obj_05)
   deleted: (pred_11 obj_05 obj_10) (pred_3)
   added: (pred_1 obj_05)
   goals met: 0 of 1
3. (op_4 obj_10 obj_11)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_11)
   goals met: 0 of 1
4. (op_4 obj_11 obj_21)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_21)
   goals met: 0 of 1
5. (op_5 obj_21 obj_05)
   deleted: (pred_1 obj_05)
   added: (pred_3) (pred_11 obj_05 obj_21)
   goals met: 0 of 1
6. (op_4 obj_21 obj_13)
   deleted: (pred_2 obj_21)
   added: (pred_2 obj_13)
   goals met: 0 of 1
7. (op_4 obj_13 obj_28)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_28)
   goals met: 0 of 1
8. (op_4 obj_28 obj_04)
   deleted: (pred_2 obj_28)
   added: (pred_2 obj_04)
   goals met: 0 of 1
9. (op_4 obj_04 obj_24)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_24)
   goals met: 0 of 1
10. (op_4 obj_24 obj_12)
   deleted: (pred_2 obj_24)
   added: (pred_2 obj_12)
   goals met: 0 of 1
11. (op_2 obj_12 obj_14)
   deleted: (pred_11 obj_14 obj_12) (pred_3)
   added: (pred_1 obj_14)
   goals met: 0 of 1
12. (op_3 obj_12 obj_08 obj_14 obj_03)
   deleted: (pred_5 obj_08)
   added: (pred_4 obj_08)
   goals met: 0 of 1
13. (op_4 obj_12 obj_08)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_08)
   goals met: 0 of 1
14. (op_4 obj_08 obj_27)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_27)
   goals met: 0 of 1
15. (op_4 obj_27 obj_21)
   deleted: (pred_2 obj_27)
   added: (pred_2 obj_21)
   goals met: 0 of 1
16. (op_1 obj_21 obj_05 obj_14)
   deleted: (pred_1 obj_14) (pred_11 obj_05 obj_21)
   added: (pred_1 obj_05) (pred_11 obj_14 obj_21)
   goals met: 1 of 1
